---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures
source: html/1f9fb9a8-ebbf-4ab3-cb5f-458afa638656.htm
---
# BuiltInFailures.GridChainSketchFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.